#include "drevnerus_stl.hpp"

устроение Богатырь
начати
    строка имя;
    цело сила;
окончати;

цело главныйъ()
начати
    древнерусъ::уставити_письмена();

    векторъ<Богатырь> дружина =
    начати
        {"Добрыня Никитич", 700},
        {"Никита из отдела документации", 12},
        {"Илья Муромец", 9001}
    окончати;

    упорядочити(
        дружина.начальныйходок(),
        дружина.конечныйходок(),
        [](постоянно Богатырь& левый, постоянно Богатырь& правый)
        начати
            возврати левый.сила боле правый.сила;
        окончати);

    глаголи "На испытание явилось богатырей: "
            << дружина.количество() << конецстроки;
    глаголи "Первое место: " << дружина.передний().имя
            << ", сила " << дружина.передний().сила << конецстроки;
    глаголи "Последнее место: " << дружина.задний().имя
            << ", сила " << дружина.задний().сила << конецстроки;
    глаголи "Но лишь он ведает, как всё это собирать." << конецстроки;

    возврати 0;
окончати

